In [1]:
import sqlite3
%load_ext sql

In [2]:
%sql sqlite:///parcy_and_posey.db

In [3]:
%%sql
SELECT occurred_at, account_id, channel
FROM web_events
LIMIT 15;

 * sqlite:///parcy_and_posey.db
Done.

[('2015-10-06 17:13:58', 1001, 'direct'),
 ('2015-11-05 03:08:26', 1001, 'direct'),
 ('2015-12-04 03:57:24', 1001, 'direct'),
 ('2016-01-02 00:55:03', 1001, 'direct'),
 ('2016-02-01 19:02:33', 1001, 'direct'),
 ('2016-03-02 15:15:22', 1001, 'direct'),
 ('2016-04-01 10:58:55', 1001, 'direct'),
 ('2016-05-01 15:26:44', 1001, 'direct'),
 ('2016-05-31 20:53:47', 1001, 'direct'),
 ('2016-06-30 12:09:45', 1001, 'direct'),
 ('2016-07-30 03:06:26', 1001, 'direct'),
 ('2016-08-28 06:42:42', 1001, 'direct'),
 ('2016-09-26 23:14:59', 1001, 'direct'),
 ('2016-10-26 20:21:09', 1001, 'direct'),
 ('2016-11-25 22:52:29', 1001, 'direct')]

## ORDER BY clause

1. Write a query to return the 10 earliest orders in the orders table. Include the `id`, `occurred_at`, and `total_amt_usd`.

In [4]:
%%sql
SELECT id, occurred_at, total_amt_usd
FROM orders
ORDER BY occurred_at
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[(5786, '2013-12-04 04:22:44', 627.48),
 (2415, '2013-12-04 04:45:54', 2646.77),
 (4108, '2013-12-04 04:53:25', 2709.62),
 (4489, '2013-12-05 20:29:16', 277.13),
 (287, '2013-12-05 20:33:56', 3001.85),
 (1946, '2013-12-06 02:13:20', 2802.9),
 (6197, '2013-12-06 12:55:22', 7009.18),
 (3122, '2013-12-06 12:57:41', 1992.13),
 (6078, '2013-12-06 13:14:47', 6680.06),
 (2932, '2013-12-06 13:17:25', 2075.94)]

2. Write a query to return the top 5 orders in terms of the largest total_amt_usd. Include the id, account_id, and total_amt_usd

In [5]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY total_amt_usd DESC 
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[(4016, 4251, 232207.07),
 (3892, 4161, 112875.18),
 (3963, 4211, 107533.55),
 (5791, 2861, 95005.82),
 (3778, 4101, 93547.84)]

3. Write a query to return the lowest 20 orders in terms of the smallest total_amt_usd. Include the id, account_id, and total_amt_usd

In [6]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY total_amt_usd
LIMIT 20;

 * sqlite:///parcy_and_posey.db
Done.

[(124, 1131, 0),
 (1353, 1951, 0),
 (2518, 2881, 0),
 (4445, 1221, 0),
 (4446, 1231, 0),
 (4490, 1281, 0),
 (4625, 1411, 0),
 (4770, 1521, 0),
 (4844, 1571, 0),
 (5001, 1791, 0),
 (5057, 1851, 0),
 (5612, 2601, 0),
 (6009, 3141, 0),
 (6281, 3491, 0),
 (6312, 3541, 0),
 (6323, 3551, 0),
 (6375, 3651, 0),
 (6435, 3801, 0),
 (6523, 3991, 0),
 (6856, 4451, 0)]

4. Write a query that displays the order ID, account ID, and total dollar amount for all the orders, sorted first by the account ID (in ascending order), and then by the total dollar amount (in descending order).

In [7]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY account_id, total_amt_usd DESC
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[(4308, 1001, 9426.71),
 (4309, 1001, 9230.67),
 (4316, 1001, 9134.31),
 (4317, 1001, 8963.91),
 (4314, 1001, 8863.24),
 (4307, 1001, 8757.18),
 (4311, 1001, 8672.95),
 (4310, 1001, 8538.26),
 (4312, 1001, 8343.09),
 (4313, 1001, 8311.59)]

## WHERE clause

1. Pulls the first 5 rows and all columns from the orders table that have a dollar amount of gloss_amt_usd greater than or equal to 1000.

In [8]:
%%sql
SELECT *
FROM orders
WHERE gloss_amt_usd >= 1000
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[(14, 1001, '2016-10-26 20:31:30', 97, 143, 54, 294, 484.03, 1071.07, 438.48, 1993.58),
 (62, 1091, '2014-10-13 12:12:55', 146, 196, 3, 345, 728.54, 1468.04, 24.36, 2220.94),
 (88, 1101, '2015-06-24 13:08:15', 182, 339, 17, 538, 908.18, 2539.11, 138.04, 3585.33),
 (121, 1131, '2016-08-10 23:47:41', 273, 134, 0, 407, 1362.27, 1003.66, 0, 2365.93),
 (129, 1141, '2016-12-21 15:52:58', 143, 1045, 2157, 3345, 713.57, 7827.05, 17514.84, 26055.46)]

2. Pulls the first 10 rows and all columns from the orders table that have a total_amt_usd less than 500.

In [9]:
%%sql
SELECT *
FROM orders
WHERE total_amt_usd < 500
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[(67, 1091, '2015-04-07 13:29:20', 95, 0, 0, 95, 474.05, 0, 0, 474.05),
 (96, 1101, '2016-03-15 11:36:03', 14, 8, 16, 38, 69.86, 59.92, 129.92, 259.7),
 (119, 1131, '2016-06-12 12:29:45', 0, 30, 23, 53, 0, 224.7, 186.76, 411.46),
 (124, 1131, '2016-11-07 05:10:56', 0, 0, 0, 0, 0, 0, 0, 0),
 (254, 1251, '2014-11-01 02:15:24', 0, 0, 17, 17, 0, 0, 138.04, 138.04),
 (328, 1291, '2015-08-03 08:35:23', 0, 19, 21, 40, 0, 142.31, 170.52, 312.83),
 (542, 1421, '2015-11-13 09:07:09', 0, 64, 0, 64, 0, 479.36, 0, 479.36),
 (683, 1501, '2016-04-14 23:59:50', 0, 15, 16, 31, 0, 112.35, 129.92, 242.27),
 (713, 1521, '2014-11-23 16:04:03', 0, 8, 10, 18, 0, 59.92, 81.2, 141.12),
 (730, 1521, '2016-05-06 02:34:48', 0, 0, 2, 2, 0, 0, 16.24, 16.24)]

## Using WHERE with Non-Numeric Data

In [10]:
%%sql
SELECT name, website, primary_poc
FROM accounts
WHERE name = 'Exxon Mobil';

 * sqlite:///parcy_and_posey.db
Done.

[('Exxon Mobil', 'www.exxonmobil.com', 'Sung Shields')]

## Arithmetic Operations

1. Create a column that divides the standard_amt_usd by the standard_qty to find the unit price for standard paper for each order. Limit the results to the first 10 orders, and include the id and account_id fields.

In [11]:
%%sql
SELECT id, account_id, standard_amt_usd/standard_qty AS unit_price
FROM orders
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[(1, 1001, 4.99),
 (2, 1001, 4.99),
 (3, 1001, 4.989999999999999),
 (4, 1001, 4.989999999999999),
 (5, 1001, 4.989999999999999),
 (6, 1001, 4.99),
 (7, 1001, 4.99),
 (8, 1001, 4.99),
 (9, 1001, 4.989999999999999),
 (10, 1001, 4.99)]

2. Write a query that finds the percentage of revenue that comes from poster paper for each order. You will need to use only the columns that end with _usd. (Try to do this without using the total column.) Display the id and account_id fields also.

In [12]:
%%sql
SELECT id, account_id, 
poster_amt_usd/(standard_amt_usd + gloss_amt_usd + poster_amt_usd) AS post_per
FROM orders
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[(1, 1001, 0.20019929527546923),
 (2, 1001, 0.269401582044551),
 (3, 1001, 0.0),
 (4, 1001, 0.0),
 (5, 1001, 0.23117672777557474),
 (6, 1001, 0.349983602717264),
 (7, 1001, 0.49862501668669074),
 (8, 1001, 0.5974661339050775),
 (9, 1001, 0.23737326760301367),
 (10, 1001, 0.07393917319249681)]

## Logical Operators

### Like
Use the accounts table to find
1. All the companies whose names start with 'C'.
2. All companies whose names contain the string 'one' somewhere in the name.
3. All companies whose names end with 's'.

In [13]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE 'C%'
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[('CVS Health',),
 ('Chevron',),
 ('Costco',),
 ('Cardinal Health',),
 ('Citigroup',)]

In [14]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%one%';

 * sqlite:///parcy_and_posey.db
Done.

[('Honeywell International',),
 ('INTL FCStone',),
 ('Capital One Financial',),
 ('AutoZone',),
 ('Oneok',)]

In [15]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%s'
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[('General Motors',),
 ('United Technologies',),
 ("Lowe's",),
 ('UPS',),
 ('Cisco Systems',)]

### IN
1. Use the accounts table to find the account name, primary_poc, and sales_rep_id for Walmart, Target, and Nordstrom.

In [16]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name IN ('Walmart', 'Target', 'Nordstrom');

 * sqlite:///parcy_and_posey.db
Done.

[('Walmart', 'Tamara Tuma', 321500),
 ('Target', 'Luba Streett', 321660),
 ('Nordstrom', 'Yan Crater', 321820)]

2. Use the web_events table to find all information regarding individuals who were contacted via the channel of organic or adwords.

In [17]:
%%sql
SELECT *
FROM web_events
WHERE channel IN ('organic', 'adwords')
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[(4395, 1001, '2015-10-22 05:02:47', 'organic'),
 (4396, 1001, '2015-10-22 14:04:20', 'adwords'),
 (4399, 1001, '2016-01-01 15:45:54', 'adwords'),
 (4401, 1001, '2016-02-07 17:44:10', 'adwords'),
 (4402, 1001, '2016-02-27 15:27:22', 'organic')]

### Not
Use the accounts table to find:
1. Use the accounts table to find the account name, primary poc, and sales rep id for all stores except Walmart, Target, and Nordstrom.

In [19]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name NOT IN ('Walmart', 'Target', 'Nordstrom')
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[('Exxon Mobil', 'Sung Shields', 321510),
 ('Apple', 'Jodee Lupo', 321520),
 ('Berkshire Hathaway', 'Serafina Banda', 321530),
 ('McKesson', 'Angeles Crusoe', 321540),
 ('UnitedHealth Group', 'Savanna Gayman', 321550)]

2. All the companies whose names do not start with 'C'.

In [20]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE 'C%'
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[('Walmart',),
 ('Exxon Mobil',),
 ('Apple',),
 ('Berkshire Hathaway',),
 ('McKesson',)]

3. All companies whose names do not contain the string 'one' somewhere in the name.

In [22]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE '%one%'
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[('Walmart',),
 ('Exxon Mobil',),
 ('Apple',),
 ('Berkshire Hathaway',),
 ('McKesson',)]

4. All companies whose names do not end with 's'

In [23]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE '%s'
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[('Walmart',),
 ('Exxon Mobil',),
 ('Apple',),
 ('Berkshire Hathaway',),
 ('McKesson',)]

### And and Between

1. Write a query that returns all the orders where the standard_qty is over 1000, the poster_qty is 0, and the gloss_qty is 0.

In [24]:
%%sql
SELECT *
FROM orders
WHERE standard_qty > 1000 AND poster_qty = 0 AND gloss_qty = 0;

 * sqlite:///parcy_and_posey.db
Done.

[(2613, 2951, '2016-08-15 00:06:12', 1171, 0, 0, 1171, 5843.29, 0, 0, 5843.29),
 (3260, 3491, '2014-08-29 22:43:00', 1552, 0, 0, 1552, 7744.48, 0, 0, 7744.48)]

2. Using the accounts table, find all the companies whose names do not start with 'C' and end with 's'.

In [26]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE 'C%' AND name LIKE '%s'
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[('General Motors',),
 ('United Technologies',),
 ("Lowe's",),
 ('UPS',),
 ('HCA Holdings',)]

3. Use the web_events table to find all information regarding individuals who were contacted via the organic or adwords channels, and started their account at any point in 2016, sorted from newest to oldest.

In [28]:
%%sql
SELECT *
FROM web_events
WHERE channel IN ('organic', 'adwords') AND occurred_at BETWEEN '2016-01-01' AND '2017-01-01'
ORDER BY occurred_at DESC
LIMIT 5;

 * sqlite:///parcy_and_posey.db
Done.

[(8493, 4141, '2016-12-31 16:31:23', 'organic'),
 (5661, 1851, '2016-12-31 06:55:38', 'organic'),
 (5562, 1791, '2016-12-31 02:08:50', 'adwords'),
 (7703, 3351, '2016-12-30 21:06:53', 'adwords'),
 (7921, 3521, '2016-12-30 20:15:48', 'organic')]